'''
Написать программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство:
1+2+...+n = n(n+1)/2, где n — любое натуральное число.
'''

n = int(input('Введите n: '))
sum = 0

for i in range(n):
    sum = sum + (i + 1)

print(f'Сумма чисел от 1 до {n}: {float(sum)}')
print(f'Сумма чисел по формуле: {(n * (n + 1)) / 2}')

if sum == (n * (n + 1)) / 2:
    print('Формула верна!')
