'''
 Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции вводятся
 пользователем. После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений.
 Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
 Если пользователь вводит неверный знак (не '0', '+', '-', '', '/'), программа должна сообщать об ошибке и снова
 запрашивать знак операции. Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел
 его в качестве делителя.
'''

a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))

op = input("Введите операцию +, -, *, / или 0 для завершения операции: ")

while True:
    a = float(input("Введите первое число: "))
    b = float(input("Введите второе число: "))
    op = input("Введите операцию +, -, *, / или 0 для завершения операции: ")
    if op == '+' or op == '-' or op == '*' or op == '/' or op == '0':
        if op == '+':
            print(f'Результат операции {a} {op} {b}: {a + b}')
        elif op == '-':
            print(f'Результат операции {a} {op} {b}: {a - b}')
        elif op == '*':
            print(f'Результат операции {a} {op} {b}: {a * b}')
        elif op == '/':
            if b == 0:
                print('Деление на ноль невозможно')
            else:
                print(f'Результат операции {a} {op} {b}: {a / b}')
        elif op == '0':
            break
    else:
        op = input("Введите операцию +, -, *, / или 0 для завершения операции: ")
