'''
Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран. Например, если введено
число 3486, надо вывести 6843.

Указание: Чтобы извлечь последнюю цифры числа, нужно найти остаток от деления его на 10.
Чтобы добавить цифру в конец числа, надо умножить это число на 10 и затем прибавить цифру-число (количество единиц).

'''

a = int(input('Введите число: '))
# Число, которое будем выводить в результате
b = 0

while a > 0:
    # начинаем с единиц числа a
    b = b * 10 + a % 10
    # Убираем последнюю цифру числа a
    a = a // 10

print(b)