'''
Посчитать четные и нечетные цифры введенного натурального числа. Например, если введено число 34560,
в нем 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).
'''

a = input('Введите целое число: ')

# Счетчик четных цифр
odd = 0
# Счетчик нечетных цифр:
even = 0

# Цикл выполняется столько раз, сколько цифр в числе
for i in range(len(a)):
    # Пример получения цифры 6 (второй с конца) в числе 34560: 34560 % 100 = 60 (остаток от деления), затем этот
    # остаток целочисленно делим на 10: 60 // 10 = 6
    num = (int(a) % (10 ^ (i + 1))) // 10 ^ i
    if num % 2 == 0:
        odd += 1
    else:
        even += 1

print(f'Количество четных цифр в числе {a}: {odd}, количество нечетных цифр: {even}')
