'''По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника, составленного
из этих отрезков. Если такой треугольник существует, то определить, является ли он разносторонним, равнобедренным
или равносторонним.'''

a = int(input("Введите длину первой стороны: "))
b = int(input("Введите длину второй стороны: "))
c = int(input("Введите длину третьей стороны: "))

if a + b <= c or a + c <= b or b + c <= a:
    print(f'Треугольника со сторонами {a}, {b} и {c} не существует')
elif a != b and a != c and b != c:
    print("Это разносторонний треугольник")
elif a == b == c:
    print("Это равносторонний треугольник")
else:
    print("Это равнобедренный треугольник")