'''
Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят,
и сколько между ними находится букв.
'''


a = ord(input('Введите первую букву: '))
b = ord(input('Введите вторую букву: '))
pos1 = a - ord('a') + 1
pos2 = b - ord('a') + 1
print(f'Позиции букв: первой - {pos1}, второй - {pos2}')
print(f'Количество букв, находящихся между этими буквами (не учитывая эти буквы): {abs(a-b) - 1}')