'''Написать программу, которая генерирует в указанных пользователем границах:
a. случайное целое число,
b. случайное вещественное число,
c. случайный символ.
Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если надо получить случайный символ
от 'a' до 'f', то вводятся эти символы.
Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.'''

import random as rd

a, b = input("Введите через пробел границы числового отрезка: ").split()
a = int(a)
b = int(b)

print(f'Случайное целое число из отрезка [{a}, {b}]: {rd.randint(a, b)}')

a, b = input("Введите через пробел границы числового отрезка: ").split()
a = float(a)
b = float(b)

print(f'Случайное вещественное число из отрезка [{a}, {b}]: {rd.uniform(a, b)}')

# Для того, чтобы получить число в заданных границах, надо вычислить длину диапазона,
# получить случайное число от 0 до значения длины диапазона, затем прибавить минимум,
# т.е. смещение от 0. Например, надо получить случайное число от 5 до 100. Длина диапазона равна 100-5=95.
# Генерируем число от 0 до 95, а затем прибавляем к нему 5. Если будет случайно получен 0,
# то добавив к нему 5, получим 5 (минимально возможное), если же будет случайно получено число 95,
# то наше число будет 100 (максимально возможное).
#
# Получение случайного символа аналогично получению целого числа. Добавляется только перевод символов в числа
# (и наоборот) по таблице кодов символов.

a, b = input("Введите через пробел символы алфавита: ").split()
a = ord(a)
b = ord(b)
n = int(rd.random() * (a - b + 1)) + a
print(f'Случайный символ из диапазона {chr(a)} - {chr(b)}: {chr(n)}')