'''Написать программу, которая генерирует в указанных пользователем границах:
a. случайное целое число,
b. случайное вещественное число,
c. случайный символ.
Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если надо получить случайный символ
от 'a' до 'f', то вводятся эти символы.
Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.'''

import random as rd

a, b = input("Введите через пробел границы числового отрезка: ").split()
a = int(a)
b = int(b)

print(f'Случайное целое число из отрезка [{a}, {b}]: {rd.randint(a, b)}')

a, b = input("Введите через пробел границы числового отрезка: ").split()
a = float(a)
b = float(b)

print(f'Случайное вещественное число из отрезка [{a}, {b}]: {rd.uniform(a, b)}')

# Для того, чтобы получить случайное число в заданных границах, надо вычислить длину диапазона,
# получить случайное число от 0 до значения длины диапазона, затем прибавить минимум,
# т.е. смещение от 0.
#
# Получение случайного символа аналогично получению целого числа. Добавляется только перевод символов в числа
# (и наоборот) по таблице кодов символов.

a, b = input("Введите через пробел символы алфавита: ").split()
a = ord(a)
b = ord(b)
n = int(rd.random() * (a - b + 1)) + a
print(f'Случайный символ из диапазона {chr(a)} - {chr(b)}: {chr(n)}')