'''По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b,
проходящей через эти точки.'''

x1 = input("Введите абсциссу первой точки: ")
y1 = input("Введите ординату первой точки: ")

x2 = input("Введите абсциссу второй точки: ")
y2 = input("Введите ординату второй точки: ")

x1 = float(x1)
y1 = float(y1)
x2 = float(x2)
y2 = float(y2)

# Уравнение прямой, проходящей через две точки: (y2 - y1) * x + (x2 -x1) * y + (x1 * y2 - x2 * y1) = 0
print(f"Уравнение прямой, проходящей через две заданные точки: {y2 - y1} * x + {x2 - x1} * y + ({x1 * y2 - x2 * y1}) = 0")
