'''Пользователь вводит номер буквы в алфавите. Определить, какая это буква.'''

a = int(input('Введите номер буквы : '))

sym = chr(a)
print(sym)

print(f'Соответствующая буква: {sym}')