'''
 Во втором массиве сохранить индексы четных элементов первого массива. Например, если дан массив со значениями
 8, 3, 15, 6, 4, 2, второй массив надо заполнить значениями 0, 3, 4, 5
 (помните, что индексация начинается с нуля), т. к. именно в этих позициях первого массива стоят четные числа.
'''
a = []
indexes = []
n = int(input("Введите количество элементов в массиве: "))
for i in range(n):
    a.append(int(input(f'Введите очередной из {n} элементов массива: ')))

for i, item in enumerate(a):
    if item % 2 == 0:
        indexes.append(i)

print(f'Массив индексов четных элементов первого массива: {indexes}')